var RelaenTip_zh ={
    "0000":"未知错误",
    "0010":"实体类 '${0}' 不存在",
    "0011":"别名 '${0}' 不存在",
    "0020":"实体类 '${0}' 不存在主键",
    "0021":"属性 '${0}' 不允许空",
    "0022":"实体类 '${0}' 不存在属性 '${1}'",
    "0100":"rql语法错误:缺少'from'关键字",
    "0101":"rql语法错误:'join on '，请仔细检查",
    "0102":"实体不存在主键，无法进行删除",
    "0103":"实体不存在主键，无法进行修改",
    "0104":"实体不存在主键，无法通过id获取",
    
    "0200":"创建数据库连接失败,错误信息:${0}",
    "0201":"打开数据库连接失败,错误信息:${0}",
    "0202":"关闭数据库连接失败,错误信息:${0}",

    "0300":"不存在处于激活状态的entity manager"
}
export {RelaenTip_zh}