export default {
    error:{
        "0000": "未知错误",
        "0001": "Relaen配置错误",
        "0002": "错误sql:${0}",
        "0010": "实体类 '${0}' 不存在",
        "0011": "别名 '${0}' 不存在",
        "0020": "实体类 '${0}' 没有id属性",
        "0021": "属性名 '${0}' 不能为空",
        "0022": "实体类 '${0}' 不存在属性 '${1}'",
        "0023": "实体类 '${0}' 的属性 '${1}' 不是关联属性",
        "0024": "实体类 '${0}' 的 属性 '${1}' 最大长度 is ${2}",
        "0025": "实体无id属性或id值",
        
        "0030": "映射属性 '${0}' 不属于实体类 '${1}'",
        
        "0050": "实体类 '${0}' id属性配置错误",
        "0051": "实体类 '${0}' id属性的sequence配置错误",
        "0052": "数据库table中无对应实体 '${0}' 的id ",

        "0100": "rql错误: 缺少关键字 'from'",
        "0101": "rql错误: 在 'join on' 附近",
        "0102": "rql错误:错误的select属性:${0}",
        "0103": "rql错误:delete 语句 缺少 where子句",
        
        "0150": "实体无id值，不能删除",
        "0151": "实体无id值，不能更新",
        "0152": "实体无id值，不能加载",
        "0153": "实体无id值，不能获取关联属性",

        "0200": "建立连接失败，原因：${0}",
        "0201": "无法打开连接，原因:${0}",
        "0202": "无法关闭连接，原因：${0}",
        "0250": "连接不存在,先建立连接",

        "0300": "方言 '${0}' 无对应provider",
        
        "0402": "乐观锁version只能是数字",
        "0403": "乐观锁version为null",
        "0404": "'in' 条件的relaeion参数必须是数组",
        "0405": "'between' 条件的relation参数是长度为2的数组",
        "0406": "没有'where'条件，无法更新或删除整个表",
        "0407": "Oracle仅支持SERIALIZABLE和READ COMMITTED隔离级",
        "0408": "找不到实体 '${0}' version",
        "0409": "实体 '${0}' version 必须是数字"
    },

    tip:{
        executeSql:"[Relaen]",
        params:"参数",
        ok:"OK",
        txbegin:"事务开始.",
        txcommit:"事务已提交.",
        txrollback:"事务已回滚.",
        error:'错误',
        message:'消息'
    }
    
}